lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_ВидыОперацийКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийКазначейства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
					<Comment>Для наличных и безналичных расчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаздатчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьСтрокуВНаборЗначенийДоступа(Организация, Таблица);
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	ТаблицаДанных = бит_УправлениеДоступомБФСлужебный.ДанныеПозицийПоЗаявке(Ссылка);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначениеКопирования = Неопределено;
	ДополнительныеСвойства.Свойство("ЗначениеКопирования", ЗначениеКопирования);

	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Выполнено = СкопироватьПозицииПриЗаписи(ЗначениеКопирования);
		
		Если НЕ Выполнено Тогда
			Отказ = Истина;			
		КонецЕсли;

		ДополнительныеСвойства.Вставить("ЗначениеКопирования", Неопределено);
		
	Иначе	
		ЗаполнитьСвязаннуюПлатежнуюПозицию();
		ЗаполнитьСвязаннуюПозициюПоступления();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
		
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если ЭтоНовый() Тогда
		РеквизитыДоИзменения = Новый Структура("ПометкаУдаления, ХозяйственнаяОперация", ПометкаУдаления, ХозяйственнаяОперация);
	Иначе	
		РеквизитыДоИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, ХозяйственнаяОперация");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("УстановкаПометкиУдаления", ПометкаУдаления <> РеквизитыДоИзменения.ПометкаУдаления);
	ДополнительныеСвойства.Вставить("РежимЗаписи", 				РежимЗаписи);
	ДополнительныеСвойства.Вставить("ИзмененаОперация", 		ХозяйственнаяОперация <> РеквизитыДоИзменения.ХозяйственнаяОперация);
	
	Если НЕ ДополнительныеСвойства.УстановкаПометкиУдаления И НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(Ссылка);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;

		Если ЗаявкаВключенаВРеестр Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось записать %1. Документ включен в реестр платежей.';
								|en = 'Failed to write to %1. The document is included in the payment register.'") ;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка);
			ВызватьИсключение ТекстСообщения;		
		КонецЕсли;	
	КонецЕсли;
	
	ОчиститьНеиспользуемыеРеквизиты();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ИспользованиеРеквизитов = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ИспользованиеРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация);
	Для каждого КлючЗначение Из ИспользованиеРеквизитов Цикл
		Если КлючЗначение.Значение = Ложь Тогда
			НепроверяемыеРеквизиты.Добавить(КлючЗначение.Ключ);			
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	СверхБюджета  = Ложь;	
	СписатьЛимиты = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

Функция ЗаполнитьСценарий() Экспорт 

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЦФО", ЦФО);
	СтруктураПараметров.Вставить("Организация", Организация);
		
	ТекущаяДата = ?(ЗначениеЗаполнено(Дата), Дата, НачалоДня(ТекущаяДатаСеанса()));
	
	КонтролироватьЗаявку 	  = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтруктураПараметров, ТекущаяДата);
	СценарийКонтроляПоБюджету = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтруктураПараметров, ТекущаяДата);

	Если КонтролироватьЗаявку Тогда
   		Возврат СценарийКонтроляПоБюджету;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда	
		ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет;	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;

	Если ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = ЗаполнитьСценарий();
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
										ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойЦФО);	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		Если ЗначениеЗаполнено(Организация) Тогда
			ВалютаДокумента = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
			ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
	КонецЕсли; 
		
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу Тогда
		
		Касса 			= Справочники.Кассы.ПолучитьКассуПоУмолчанию(Организация, ВалютаДокумента);
		КассаПолучатель = Касса;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк 
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк Тогда		
		
		Касса 					 = Справочники.Кассы.ПолучитьКассуПоУмолчанию(Организация, ВалютаДокумента);
		БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация, ВалютаДокумента);
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка 
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка Тогда		
		
		БанковскийСчет	= Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация, ВалютаДокумента);
		КассаПолучатель = Справочники.Кассы.ПолучитьКассуПоУмолчанию(Организация, ВалютаДокумента);
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет Тогда	
		
		БанковскийСчет			 = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация, ВалютаДокумента);
		БанковскийСчетПолучатель = БанковскийСчет;
		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Инициатор = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
					ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойИнициаторКазначейства);
	
	Если НЕ ЗначениеЗаполнено(Инициатор) Тогда
		Инициатор = Ответственный;
	КонецЕсли;

КонецПроцедуры

Функция СкопироватьПозицииПриЗаписи(ЗначениеКопирования)
	
	Выполнено = Истина;
	
	РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ЗначениеКопирования);
	Если ЗначениеЗаполнено(РезультатПоиска.Позиция) Тогда
		РеквизитыДокумента = Документы.бит_кзн_ПлатежнаяПозиция.РеквизитыДокумента(РезультатПоиска.Позиция);
		ДанныеЗаполнения   = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыДокумента[0]);
		
		Исключения = Новый Структура;
		Исключения.Вставить("Cсылка", 				   Неопределено);
		Исключения.Вставить("Дата", 				   Дата);
		Исключения.Вставить("Номер", 				   "");
		Исключения.Вставить("Проведен", 			   Ложь);
		Исключения.Вставить("ПометкаУдаления", 		   Ложь);
		Исключения.Вставить("ДокументОснование", 	   Неопределено);
		Исключения.Вставить("ДокументПланирования",    Ссылка);
		Исключения.Вставить("ОтправленНаСогласование", Ложь);
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Исключения); 
		
		Позиция = Документы.бит_кзн_ПлатежнаяПозиция.СоздатьДокумент();
		Позиция.Заполнить(ДанныеЗаполнения);
		
		Позиция.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Позиция, РежимЗаписиДокумента.Запись, , "Ошибки");
	КонецЕсли;
	
	Если НЕ Выполнено Тогда
		Возврат Выполнено;
	КонецЕсли;
	
	РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(ЗначениеКопирования);
	Если ЗначениеЗаполнено(РезультатПоиска.Позиция) Тогда
		РеквизитыДокумента = Документы.бит_кзн_ПозицияПоступления.РеквизитыДокумента(РезультатПоиска.Позиция);
		ДанныеЗаполнения   = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыДокумента[0]);
		
		Исключения = Новый Структура;
		Исключения.Вставить("Cсылка", 				   Неопределено);
		Исключения.Вставить("Дата", 				   Дата);
		Исключения.Вставить("Номер", 				   "");
		Исключения.Вставить("Проведен", 			   Ложь);
		Исключения.Вставить("ПометкаУдаления", 		   Ложь);
		Исключения.Вставить("ДокументОснование", 	   Неопределено);
		Исключения.Вставить("ДокументПланирования",    Ссылка);
		Исключения.Вставить("ОтправленНаСогласование", Ложь);
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Исключения); 
		
		Позиция = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();
		Позиция.Заполнить(ДанныеЗаполнения);
		
		Позиция.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Позиция, РежимЗаписиДокумента.Запись, , "Ошибки");
	КонецЕсли;
	
	Возврат Выполнено;

КонецФункции

Процедура ОчиститьНеиспользуемыеРеквизиты()

	Если НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;

	ИспользованиеРеквизитов = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ИспользованиеРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация);
	Для каждого КлючЗначение Из ИспользованиеРеквизитов Цикл
		Если КлючЗначение.Значение = Ложь Тогда
			ЭтотОбъект[КлючЗначение.Ключ] = Неопределено;	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСвязаннуюПлатежнуюПозицию()
	
	Попытка
		
		ПлатежнаяПозиция = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Ссылка);
		Если НЕ ЗначениеЗаполнено(ПлатежнаяПозиция.Позиция) Тогда
			ПлатежнаяПозицияОбъект = Документы.бит_кзн_ПлатежнаяПозиция.СоздатьДокумент();
			ПлатежнаяПозицияОбъект.Заполнить(Ссылка);
		Иначе
			ПлатежнаяПозицияОбъект = ПлатежнаяПозиция.Позиция.ПолучитьОбъект();
			ПлатежнаяПозицияОбъект.Заблокировать();
			Если ПометкаУдаления <> ПлатежнаяПозицияОбъект.ПометкаУдаления Тогда
				ПлатежнаяПозицияОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЕсли;
			
			Результат = Документы.бит_кзн_ПлатежнаяПозиция.ДанныеЗаполненияИзОснования(Ссылка);
			Если ДополнительныеСвойства.ИзмененаОперация Тогда
				ЗаполнитьЗначенияСвойств(ПлатежнаяПозицияОбъект, Результат[0]);
			Иначе	
				ЗаполнитьЗначенияСвойств(ПлатежнаяПозицияОбъект, Результат[0],, "СтатьяОборотов");
			КонецЕсли;
			
			// Заполнение реквизитов "Аналитика_n".
			ПараметрыУстановки = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону("", 
									"Аналитика_", "СтатьяОборотов");		
			ПараметрыУстановки.ДопРеквизиты.Вставить("Организация", Организация);
			
			РеквизитыОбъекта = Документы.бит_кзн_ПлатежнаяПозиция.РеквизитыОбъектаДляПодстановкиВАналитики(ПлатежнаяПозицияОбъект);
			
			Для каждого Значение Из РеквизитыОбъекта Цикл 
				Если ЗначениеЗаполнено(Значение) Тогда
					бит_МеханизмДопИзмерений.ЗаполнитьДопАналитикуПоДаннымДокумента(ПлатежнаяПозицияОбъект, Значение, ПараметрыУстановки);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если НЕ ПлатежнаяПозицияОбъект.ПроверитьЗаполнение() Тогда
				ТекстСообщения = НСтр("ru = 'Документ ""%1"" заполнен с ошибками.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ПлатежнаяПозиция.Позиция);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;		
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		ПлатежнаяПозицияОбъект.Записать(ДополнительныеСвойства.РежимЗаписи);
		
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры
	
Процедура ЗаполнитьСвязаннуюПозициюПоступления()
	
	Попытка
		
		ПозицияПоступления = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Ссылка);
		Если НЕ ЗначениеЗаполнено(ПозицияПоступления.Позиция) Тогда
			ПозицияПоступленияОбъект = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();
			ПозицияПоступленияОбъект.Заполнить(Ссылка);
		Иначе
			ПозицияПоступленияОбъект = ПозицияПоступления.Позиция.ПолучитьОбъект();
			ПозицияПоступленияОбъект.Заблокировать();
			Если ПометкаУдаления <> ПозицияПоступленияОбъект.ПометкаУдаления Тогда
				ПозицияПоступленияОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЕсли;
			
			Результат = Документы.бит_кзн_ПозицияПоступления.ДанныеЗаполненияИзОснования(Ссылка);
			Если ДополнительныеСвойства.ИзмененаОперация Тогда
				ЗаполнитьЗначенияСвойств(ПозицияПоступленияОбъект, Результат);
			Иначе	
				ЗаполнитьЗначенияСвойств(ПозицияПоступленияОбъект, Результат,, "СтатьяОборотов");
			КонецЕсли;
			
			// Заполнение реквизитов "Аналитика_n".
			ПараметрыУстановки = бит_МеханизмДопИзмеренийКлиентСервер.ПараметрыУстановкиСвойствАналитикПоШаблону("", 
									"Аналитика_", "СтатьяОборотов");		
			ПараметрыУстановки.ДопРеквизиты.Вставить("Организация", Организация);
			
			РеквизитыОбъекта = Документы.бит_кзн_ПозицияПоступления.РеквизитыОбъектаДляПодстановкиВАналитики(ПозицияПоступленияОбъект);
			
			Для каждого Значение Из РеквизитыОбъекта Цикл 
				Если ЗначениеЗаполнено(Значение) Тогда
					бит_МеханизмДопИзмерений.ЗаполнитьДопАналитикуПоДаннымДокумента(ПозицияПоступленияОбъект, Значение, ПараметрыУстановки);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если НЕ ПозицияПоступленияОбъект.ПроверитьЗаполнение() Тогда
				ТекстСообщения = НСтр("ru = 'Документ ""%1"" заполнен с ошибками.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ПозицияПоступления.Позиция);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;		
		КонецЕсли;	
		ПозицияПоступленияОбъект.Записать(ДополнительныеСвойства.РежимЗаписи);
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
